### Terraformの各結果
#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Terraform Validation `success`

<details><summary>Terraform Plan</summary>

```terraform
module.compute.data.aws_ami.amazon_linux: Reading...
module.network.aws_vpc.vpc: Refreshing state... [id=vpc-07bdd18d805094369]
module.compute.data.aws_ami.amazon_linux: Read complete after 0s [id=ami-0d5f5a4eaac1481cb]
module.network.aws_subnet.subnet: Refreshing state... [id=subnet-0c693021df78ee00b]
module.network.aws_route_table.rtb: Refreshing state... [id=rtb-090138355244d59a7]
module.network.aws_internet_gateway.igw: Refreshing state... [id=igw-0bcf093f31b8081cb]
module.network.aws_security_group.sg: Refreshing state... [id=sg-0af5c3b70a658410d]
module.network.aws_route.route: Refreshing state... [id=r-rtb-090138355244d59a71080289494]
module.network.aws_route_table_association.rtba: Refreshing state... [id=rtbassoc-0cb9fca5b425e8b25]
module.compute.aws_instance.ec2: Refreshing state... [id=i-0e589a0de3410dcf7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.compute.aws_instance.ec2 must be replaced
-/+ resource "aws_instance" "ec2" {
      ~ ami                                  = "ami-0244ef75e95122fd9" -> "ami-0d5f5a4eaac1481cb" # forces replacement
      ~ arn                                  = "arn:aws:ec2:ap-northeast-1:657709068990:instance/i-0e589a0de3410dcf7" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "ap-northeast-1a" -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0e589a0de3410dcf7" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-01c4a943bb201dd90" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-173.ap-northeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.173" -> (known after apply)
      ~ public_dns                           = "ec2-13-158-141-136.ap-northeast-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "13.158.141.136" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "ec2-t2-micro"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (11 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ primary_network_interface (known after apply)
      - primary_network_interface {
          - delete_on_termination = true -> null
          - network_interface_id  = "eni-01c4a943bb201dd90" -> null
        }

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0b5ab10e751139050" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>